# __________________________________________
# Введіть три числа і виведіть на екран їх
# значення та значення суми цих чисел

# a = input("ведьть перше чісло: ")
# b = input("ведьть друге чісло: ")
# v = input("ведьть третє чісло:")
# res = a + b + v
# print("результат:" + a + b + v)


# _____________________________________
# 2 Напишіть програму, яка обраховує
# середнє арифметичне двох чисел

# a = int(input("ведьть перше чісло: "))
# b = int(input("ведьть друге чісло: "))
# print(a + b / 2)


# _______________________________________________
# 3. Напишіть програму, яка переводить кілометри
# в метри. Кілометри вводяться з клавіатури

# a = int(input("ведьть чісло: "))
# print(a * 1000)


# ____________________________________________________________
# 4 Разрабити програму, яка організовує діалог з користувачем
# і дозволяє обчислити по вказаній сумі і курсу євро, долара та російськогл
# рябля суму в гривнях. Примітка! З використанням констант

# manu = input("що будете міняти? (USD, EUR, RUR):")
# b = float(input("яку суму:"))
# if manu == "USD":
#     c = b * 27.650
#     print("ваша сума " + str(c))
# elif manu == "EUR":
#     c = b * 29.250
#     print("ваша сума " + str(c))
# elif manu == "RUR":
#     c = b * 0.310
#     print("ваша сума" + str(c))
# else:
#     print("eroor")


# _________________________________________________
# 5:Дано 3 числа. Визначити чи є серед них додатні

# a = int(input("ENTER (A) "))
# b = int(input("ENTER (B) "))
# c = int(input("ENTER (C) "))
# if a > (0):
#     print("A ", a)
# if b > (0):
#     print("B ", b)
# if c > (0):
#     print("C ", c)


# ____________________________________________________
# 6:Дано три числа. Визначити чи рівні вони між собою

# a = int(input("ведьть перше чісло:"))
# b = int(input("ведьть друге чісло:"))
# c = int(input("ведьть друге чісло:"))
# if (a == b) and (a == c) and (b == c):
#     print(3)
# elif (a == b) or (a == c) or (b == c):
#     print(2)
# else:
#     print(0)


# ______________________________________________________________________________________________
# 7. Розробити програму, що переводить значення температури в градусах по Цельсію в температуру
# по Фаренгейту та навпаки. Співвідношення між температурами визначається
#  формулою: TF = TC *1.8 +32. Діалог с користувачем реалізувати через систему меню.

t = input("Введiть (число C) щоб перевести градуси цельсія в темпр по Фарангейту або (число F) щоб перевести темпр Фарангейтa в градуси цельсія:")
sign = t[-1]
t = int(t[0:-1])
if sign == 'C' or sign == 'c':
    t = round(t * (9/5) + 32)
    print(str(t) + 'F')
elif sign == 'F' or sign == 'f':
    t = round((t - 32) * (5/9))
    print(str(t) + 'C')

# _________________________________________________________________________________
# 8 .Відомо, що 1 дюйм дорівнює 2.54 см. Розробити програму, що переводить дюйми в
# сантиметри и навпаки. Діалог с користувачем реалізувати через систему меню.

# manu = input(
#     "Введiть (1) щоб перевести дюйми в сантиметри або (2) щоб перевести сантиметри в дюйми:")
# b = float(input("яке число:"))
# if manu == "1":
#     c = b * 2.54
#     print("ваша сума" + str(c))
# elif manu == "2":
#     c = b * 0.3937
#     print("ваша сума" + str(c))
# else:
#     print("eroor")
