# Комп’ютер кидає кубик(за допомогою генератора випадкових чисел). Порахувати через скільки спроб випаде шістка.

from random import randint
import json


i1 = 0
i2 = 0
while i2 <= 10:
    p1 = 0
    p2 = 0

    input("Ви:_Бросить кости !\nНажмите 1 :")
    f = randint(1, 6)
    h = randint(1, 6)
    sum1 = f+h
    o = randint(1, 6)
    p = randint(1, 6)
    sum2 = o+p
    print("Ваш бросок:", sum1)
    if sum1 % 2 == 0:
        p1 += 2
        i1 += p1
        print("Ви:\n", i1, "бали")
    else:
        p1 += 1
        i1 += p1
        print("ви:\n", i1, "бали")

    print("🎲🎲🎲")
    input("PC:_киньте кocти !\nНатисніть 2 :")
    print("бросок PC:", sum2)

    if sum2 % 2 == 0:
        p2 += 2
        i2 += p2
        print("PC:\n", i2, "бали")
    else:
        p2 += 1
        i2 += p2
        print("PC:\n", i2, "бали")

    print("_____________________")
if i1 > i2:
    print("|_-_-_-_-_-_-_-_-_-_-_-_-_-_|")
    print("Ти Виграв:",  i1, "балів")
    print("|_-_-_-_-_-_-_-_-_-_-_-_-_-_|")
elif i2 > i1:
    print("|_-_-_-_-_-_-_-_-_-_-_-_-_-_|")
    print("PC Виграв:",  i2, "балів")
    print("|_-_-_-_-_-_-_-_-_-_-_-_-_-_|")
else:
    print("|_-_-_-_-_-_-_-_-_-_-_-_-_-_|")
    print("нічія:", i1, "=", i2)
    print("|_-_-_-_-_-_-_-_-_-_-_-_-_-_|")
